DataProcessors/ЗаполнениеСреднихЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнениеСреднихЦен</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/СредниеЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СредниеЦены</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СредняяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Автомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Автомобили</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Марка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДвигателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипДвигателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКоробкиПередач</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемДвигателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Состояниее</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗаполнениеСреднихЦен/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Каталог обмена файлами с ИИ в репозитории конфигурации.
//
// Возвращаемое значение:
//  Строка
//
Функция КаталогОбменаПоУмолчанию() Экспорт
	
	Возврат "C:\Users\d.proskurnin\Desktop\Рабочий стол\Хатакон\dashrent\exchange";
	
КонецФункции

// Имя JSON-файла запроса цен.
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяФайлаЗапроса() Экспорт
	
	Возврат "cars-request.json";
	
КонецФункции

// Имя сигнала запроса для ИИ.
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяСигналаЗапроса() Экспорт
	
	Возврат "request.signal";
	
КонецФункции

// Имя JSON-файла ответа с ценами.
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяФайлаОтвета() Экспорт
	
	Возврат "cars-prices.json";
	
КонецФункции

// Имя сигнала ответа для загрузки в 1С.
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяСигналаОтвета() Экспорт
	
	Возврат "response.signal";
	
КонецФункции

// Собирает автомобили справочника и строку описания для поиска цены.
//
// Возвращаемое значение:
//  ТаблицаЗначений:
//  * Автомобиль - СправочникСсылка.Автомобили
//  * Идентификатор - Строка
//  * Описание - Строка
//  * СредняяЦена - Число
//  * Источник - Строка
//
Функция ТаблицаАвтомобилей() Экспорт
	
	ТаблицаАвтомобилей = НоваяТаблицаАвтомобилей();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Автомобили.Ссылка КАК Автомобиль,
	|	Автомобили.Марка КАК Марка,
	|	Автомобили.Модель КАК Модель,
	|	Автомобили.ГодВыпуска КАК ГодВыпуска,
	|	Автомобили.Пробег КАК Пробег,
	|	Автомобили.ОбъемДвигателя КАК ОбъемДвигателя,
	|	Автомобили.ТипДвигателя КАК ТипДвигателя,
	|	Автомобили.ТипКоробкиПередач КАК ТипКоробкиПередач,
	|	Автомобили.Состояние КАК Состояние
	|ИЗ
	|	Справочник.Автомобили КАК Автомобили
	|ГДЕ
	|	НЕ Автомобили.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Автомобили.Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаТаблицы = ТаблицаАвтомобилей.Добавить();
		СтрокаТаблицы.Автомобиль = Выборка.Автомобиль;
		СтрокаТаблицы.Идентификатор = XMLСтрока(Выборка.Автомобиль);
		СтрокаТаблицы.Описание = ОписаниеАвтомобиля(Выборка);
		
	КонецЦикла;
	
	Возврат ТаблицаАвтомобилей;
	
КонецФункции

// Формирует JSON со строками автомобилей для передачи ИИ.
//
// Параметры:
//  ТаблицаАвтомобилей - ТаблицаЗначений - см. ТаблицаАвтомобилей
//
// Возвращаемое значение:
//  Строка
//
Функция JsonДанныхДляПоискаЦен(ТаблицаАвтомобилей) Экспорт
	
	АвтомобилиДляПоиска = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ТаблицаАвтомобилей Цикл
		
		ДанныеАвтомобиля = Новый Структура;
		ДанныеАвтомобиля.Вставить("Идентификатор", СтрокаТаблицы.Идентификатор);
		ДанныеАвтомобиля.Вставить("Описание", СтрокаТаблицы.Описание);
		АвтомобилиДляПоиска.Добавить(ДанныеАвтомобиля);
		
	КонецЦикла;
	
	ДанныеФайла = Новый Структура;
	ДанныеФайла.Вставить("Автомобили", АвтомобилиДляПоиска);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеФайла);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

// Заполняет средние цены в таблице по JSON-ответу ИИ.
//
// Параметры:
//  ТаблицаАвтомобилей - ТаблицаЗначений - см. ТаблицаАвтомобилей
//  ТекстJson - Строка - JSON с массивом Цены
//
// Возвращаемое значение:
//  Число - количество сопоставленных цен
//
Функция ПрименитьЦеныИзJson(ТаблицаАвтомобилей, ТекстJson) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJson);
	ДанныеФайла = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	ЦеныПоИдентификатору = Новый Соответствие;
	
	Если ТипЗнч(ДанныеФайла) = Тип("Структура") И ДанныеФайла.Свойство("Цены") Тогда
		Для Каждого СтрокаЦены Из ДанныеФайла.Цены Цикл
			ЦеныПоИдентификатору.Вставить(СтрокаЦены.Идентификатор, СтрокаЦены);
		КонецЦикла;
	КонецЕсли;
	
	КоличествоЦен = 0;
	
	Для Каждого СтрокаТаблицы Из ТаблицаАвтомобилей Цикл
		
		СтрокаЦены = ЦеныПоИдентификатору.Получить(СтрокаТаблицы.Идентификатор);
		Если СтрокаЦены = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы.СредняяЦена = СтрокаЦены.СредняяЦена;
		Если СтрокаЦены.Свойство("Источник") Тогда
			СтрокаТаблицы.Источник = СтрокаЦены.Источник;
		КонецЕсли;
		
		КоличествоЦен = КоличествоЦен + 1;
		
	КонецЦикла;
	
	Возврат КоличествоЦен;
	
КонецФункции

// Записывает заполненные средние цены в регистр сведений СредниеЦены.
//
// Параметры:
//  ТаблицаАвтомобилей - ТаблицаЗначений - см. ТаблицаАвтомобилей
//
// Возвращаемое значение:
//  Число - количество записанных строк регистра
//
Функция ЗаписатьСредниеЦены(ТаблицаАвтомобилей) Экспорт
	
	ПериодЗаписи = ТекущаяДатаСеанса();
	КоличествоЗаписей = 0;
	
	НачатьТранзакцию();
	Попытка
		
		Для Каждого СтрокаТаблицы Из ТаблицаАвтомобилей Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.Автомобиль) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.СредняяЦена) Тогда
				Продолжить;
			КонецЕсли;
			
			МенеджерЗаписи = РегистрыСведений.СредниеЦены.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ПериодЗаписи;
			МенеджерЗаписи.Автомобиль = СтрокаТаблицы.Автомобиль;
			МенеджерЗаписи.СредняяЦена = СтрокаТаблицы.СредняяЦена;
			МенеджерЗаписи.Записать();
			
			КоличествоЗаписей = КоличествоЗаписей + 1;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Заполнение средних цен'"),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Обработки.ЗаполнениеСреднихЦен,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	Возврат КоличествоЗаписей;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НоваяТаблицаАвтомобилей()
	
	ТаблицаАвтомобилей = Новый ТаблицаЗначений;
	ТаблицаАвтомобилей.Колонки.Добавить("Автомобиль", Новый ОписаниеТипов("СправочникСсылка.Автомобили"));
	ТаблицаАвтомобилей.Колонки.Добавить("Идентификатор", ОписаниеТипаСтроки(36));
	ТаблицаАвтомобилей.Колонки.Добавить("Описание", ОписаниеТипаСтроки(500));
	ТаблицаАвтомобилей.Колонки.Добавить("СредняяЦена", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаАвтомобилей.Колонки.Добавить("Источник", ОписаниеТипаСтроки(250));
	
	Возврат ТаблицаАвтомобилей;
	
КонецФункции

Функция ОписаниеТипаСтроки(Длина)
	
	Возврат Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(Длина));
	
КонецФункции

Функция ОписаниеАвтомобиля(ДанныеАвтомобиля)
	
	ЧастиОписания = Новый Массив;
	ДобавитьЧастьОписания(ЧастиОписания, ДанныеАвтомобиля.Марка);
	ДобавитьЧастьОписания(ЧастиОписания, ДанныеАвтомобиля.Модель);
	
	Если ЗначениеЗаполнено(ДанныеАвтомобиля.ГодВыпуска) Тогда
		ЧастиОписания.Добавить(Формат(ДанныеАвтомобиля.ГодВыпуска, "ДФ=yyyy"));
	КонецЕсли;
	
	Если ДанныеАвтомобиля.Пробег > 0 Тогда
		ЧастиОписания.Добавить(СтрШаблон(НСтр("ru = '%1 км'"), Формат(ДанныеАвтомобиля.Пробег, "ЧГ=0")));
	КонецЕсли;
	
	Если ДанныеАвтомобиля.ОбъемДвигателя > 0 Тогда
		ЧастиОписания.Добавить(СтрШаблон(НСтр("ru = '%1 л'"), Формат(ДанныеАвтомобиля.ОбъемДвигателя, "ЧДЦ=1; ЧРД=.")));
	КонецЕсли;
	
	ДобавитьЧастьОписания(ЧастиОписания, Строка(ДанныеАвтомобиля.ТипДвигателя));
	ДобавитьЧастьОписания(ЧастиОписания, ДанныеАвтомобиля.ТипКоробкиПередач);
	ДобавитьЧастьОписания(ЧастиОписания, Строка(ДанныеАвтомобиля.Состояние));
	
	Возврат СтрСоединить(ЧастиОписания, " ");
	
КонецФункции

Процедура ДобавитьЧастьОписания(ЧастиОписания, ЗначениеЧасти)
	
	Если Не ЗначениеЗаполнено(ЗначениеЧасти) Тогда
		Возврат;
	КонецЕсли;
	
	ЧастиОписания.Добавить(СокрЛП(Строка(ЗначениеЧасти)));
	
КонецПроцедуры

#КонецОбласти
